app/controllers/listings_controller.rb

  def create
    @listing = Listing.new(listing_params)
    @user = current_user
    @listing.set_user!(current_user)

    respond_to do |format|
      if @listing.save
---
INSERT INTO "listings" ("title", "description", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sfesf"], ["description", "dsfsdfq"], ["price", 40.0], ["user_id", 1], ["created_at", "2015-05-10 10:26:36.538257"], ["updated_at", "2015-05-10 10:26:36.538257"]]